#pragma once
#include "Common/MyMath.h"
#include <iostream>

//========================================================================================
/// [機能] マウスの位置変化を取得したり、カーソル位置を無理やり移動させたりできる
//========================================================================================
class Mouse {
public:
	Mouse() {}
	~Mouse() {}

	static void Update();

	//-------------------------------------------------------
	/// [機能] 現在フレームと前フレームのマウスの位置を取得
	//-------------------------------------------------------
	static POINT GetRelativeMovement();

	//--------------------------------
	/// [機能] カーソルの位置を戻す
	//--------------------------------
	static void ResetMousePos();

	

private:
	static POINT mCurrentCursorPos;
	static POINT mPrevCursorPos;

};


