#pragma once
#include <memory>


//===================================================================================================================
/// [機能] こいつが包含しているSceneの実際の型が現在のゲームシーン。RunSceneがSceneの更新や描画関数を呼び出す
//===================================================================================================================
class Sequence {
public:
	Sequence();
	~Sequence();


	//---------------------------------------------------
	/// [機能] 今がランタイム中かを取得する
	/// [戻り値] ランタイムかどうか
	//---------------------------------------------------
	static bool IsRunTime();

	//---------------------------------------------------
	/// [機能] 現在設定されているシーンを開始します
	//---------------------------------------------------
	void RunScene();
	

private:
	class Scene* mScene; // 現在のゲームシーン。例えばTitleクラスを指し示すなら、現在はタイトルシーン。
	static bool mIsRunTime;
};
